{
  "architectures": [
    "SmolLM3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": null,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 65536,
  "model_type": "smollm3",
  "no_rope_layer_interval": 4,
  "num_attention_heads": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 4,
  "pad_token_id": 128004,
  "pretraining_tp": 2,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 5000000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.0.dev0",
  "transformers.js_config": {
    "use_external_data_format": true,
    "dtype": "q4",
    "kv_cache_dtype": {
      "q4f16": "float16",
      "fp16": "float16"
    }
  },
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 128256
}
